Revit 2026 API

# UIMacroManager Class

---

The UI macro manager to support Macro operations.

SystemObject Autodesk.Revit.UI.MacrosUIMacroManager

**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UIMacroManager : IDisposable
```
```vb
Public Class UIMacroManager
	Implements IDisposable
```
```cpp
public ref class UIMacroManager : IDisposable
```
```fsharp
type UIMacroManager =
    class
        interface IDisposable
    end
```

The UIMacroManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroManager | The DB macro manager. |

|  | Name | Description |
| --- | --- | --- |
|  | AddModule | Adds a MacroModule to the application. |
|  | Dispose | Releases all resources used by the UIMacroManager |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMacroManager | Gets the UI Macro manager from the UI application. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | RemoveModule | Removes a MacroModule. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Macros Namespace